import type { Metadata } from 'next';
import Link from 'next/link';

import Comments from '../components/comments/comments';
import environment from '../environment';

export const metadata: Metadata = {
  alternates: {
    canonical: `${environment.NEXT_PUBLIC_SITE}/about/`,
  },
  applicationName: 'Корені',
  authors: [
    {
      name: 'Віталій Перегончук',
      url: 'https://www.linkedin.com/in/vitalii-perehonchuk-10570693/',
    },
    {
      name: 'Аліна Лістунова',
      url: 'https://www.linkedin.com/in/alina-listunova/',
    },
  ],
  creator: 'Віталій Перегончук',
  description: 'Про проєкт "Корені", його автора та мотивацію для його появи.',
  generator: 'Next.js',
  keywords: [
    'Корені',
    'генеалогія',
    'українська генеалогія',
    'родовід',
    'Віталій Перегончук',
    'проєкт',
  ],
  openGraph: {
    description:
      'Про проєкт "Корені", його автора та мотивацію для його появи.',
    locale: 'uk-UA',
    siteName: 'Корені',
    title: 'Корені | Про проєкт',
    type: 'website',
    url: `${environment.NEXT_PUBLIC_SITE}/about/`,
  },
  title: 'Корені | Про проєкт',
  twitter: {
    card: 'summary_large_image',
    creator: '@negativo_ua',
    description:
      'Про проєкт "Корені", його автора та мотивацію для його появи.',
    images: [`${environment.NEXT_PUBLIC_SITE}/icon.png`],
  },
};

export default function AboutPage() {
  return (
    <>
      <article className="col-sm">
        <h1>Про проєкт "Корені"</h1>

        <h2>Ліцензія</h2>
        <p>
          Дивіться на окремій сторінці: <Link href="/license">Ліцензія</Link>
        </p>

        <h2>Хто автор Коренів?</h2>
        <p>
          Привіт. Я – Віталій Перегончук, розробник ПЗ,{' '}
          <a
            href="https://www.linkedin.com/in/vitalii-perehonchuk-10570693/"
            target="_blank"
          >
            ось мій профіль на LinkedIn
          </a>
          , наприклад.
        </p>
        <p>
          Крім промислової розробки постійно займаюсь різноманітними
          хобі-проєктами. Серед актуальних:
        </p>
        <ul>
          <li>
            <a href="https://webdoky.org" target="_blank">
              WebDoky
            </a>{' '}
            – український переклад статей MDN
          </li>
          <li>
            <a href="https://ymh8.pages.dev" target="_blank">
              You Must Hear
            </a>{' '}
            – тут куди важче розповісти, що це таке 😂
          </li>
        </ul>

        <h2>Подяки</h2>
        <p>Уклінно дякую наступним особам і спільнотам:</p>
        <ul>
          <li>
            Володимиру Цибульському – за результати довгих років індексації
          </li>
          <li>
            Спільноті "Генеалогічне IT" – за концентрацію контексту та
            обговорення
          </li>
          <li>Проєкту "Індекси України" – за результати своєї праці</li>
          <li>
            Спільноті{' '}
            <a
              href="https://www.facebook.com/groups/425347154227812"
              target="_blank"
            >
              UAGenealogy на Facebook
            </a>{' '}
            і{' '}
            <a href="https://ukrgenealogy.com.ua/" target="_blank">
              УГФ – Українському Генеалогічному Форуму
            </a>{' '}
            – за формування українського генеалогічного дискурсу.
          </li>
          <li>
            Аліні Лістуновій – за PR з цим чудовим UX, за рефакторинг, коментарі
            та побажання.
          </li>
        </ul>

        <h2>Чому з'явилися Корені?</h2>
        <p>
          Вже деякий час я цікавлюся генеалогією; найдавніший відомий мій предок
          народився приблизно 1597 року. В процесі дослідження села Політанок,
          що в Жмеринському районі, взявся до суцільного дослідження генеалогії
          всього населеного пункту, а також – індексації всіх наявних
          генеалогічних матеріалів, яких, на щастя, збереглося чимало.
        </p>
        <p>
          Отже, я дослідив рідне село й маю купу таблиць Google Spreadsheets з
          індексаціями. У політанській Чудо-Михайлівській церкві, як це буває,
          хрестилися та вінчалися не тільки місцеві, а й:
        </p>
        <ul>
          <li>Захарія Іванів Стусь (у 1806 році), явно не місцевий</li>
          <li>
            Австрійські піддані Яків Йосипів Легуневич, Григорій Семенів
            Сенитович і Анна Іванова Дмитрюк
          </li>
          <li>Контролер винокурні Олександр Іванів Богданов</li>
          <li>Пруський підданий лютеранин Роберт Августів Врона</li>
          <li>Місцеве духовенство</li>
          <li>Шляхта</li>
          <li>а також купа селян навколишніх сіл</li>
        </ul>
        <p>
          В сленгу генеалогії таких осіб звуть "загуляками". Найбільше їх у
          великих містах і великих залізничних вузлах, проте траплялися і в
          глушині.
        </p>
        <p>
          Що робити з "загуляками"? Один варіант – викладати в{' '}
          <a
            href="https://www.facebook.com/groups/1828267990648440"
            target="_blank"
          >
            Загуляк на Facebook
          </a>
          . Іще можна викладати таблиці на форуми й у соцмережах, сподіваючись,
          що на таблицю натрапить саме той, хто треба.
        </p>
        <p>
          Я вирішив піти далі й розробити вебзастосунок, який агрегував би
          таблиці від різних дослідників. Додатковою мотивацією є аби таблиці не
          лежали без діла – раптом ще комусь допоможуть?
        </p>

        <h2>Як можна допомогти?</h2>
        <p>
          Якщо маєте таблиці-індексації – присилайте мені на{' '}
          <a href="mailto:brute18@gmail.com">brute18@gmail.com</a>. Корені
          спроєктовані таким чином, щоб додавання нової таблиці займало не
          більше 5 хвилин, тому додавання нових даних відбудеться швидко.
        </p>
        <p>
          Якщо ж бажаєте допомогти з кодом – приходьте на{' '}
          <a href="https://github.com/undead404/koreni" target="_blank">
            Корені в Github
          </a>
          , реєструйте проблеми, присилайте PR!
        </p>
        <p>
          І – якщо Корені допомогли в якихось пошуках – напишіть мені на{' '}
          <a href="mailto:brute18@gmail.com">brute18@gmail.com</a> обов'язково:
          я б дуже хотів знати, що моя праця допомогла комусь.
        </p>
      </article>
      <Comments />
    </>
  );
}
